<?php

return [
    'navigation' => [
        'title' => 'Плани активностей',
    ],

    'form' => [
        'name'   => 'Назва',
        'status' => 'Статус',
    ],

    'table' => [
        'columns' => [
            'name'       => 'Назва',
            'status'     => 'Статус',
            'created-at' => 'Створено',
            'updated-at' => 'Оновлено',
        ],

        'groups' => [
            'name'       => 'Назва',
            'status'     => 'Статус',
            'created-at' => 'Створено',
            'updated-at' => 'Оновлено',
        ],

        'actions' => [
            'restore' => [
                'notification' => [
                    'title' => 'План активності відновлено',
                    'body'  => 'План активності було успішно відновлено.',
                ],
            ],

            'delete' => [
                'notification' => [
                    'title' => 'План активності видалено',
                    'body'  => 'План активності було успішно видалено.',
                ],
            ],

            'force-delete' => [
                'notification' => [
                    'title' => 'План активності остаточно видалено',
                    'body'  => 'План активності було остаточно видалено успішно.',
                ],
            ],
        ],

        'bulk-actions' => [
            'restore' => [
                'notification' => [
                    'title' => 'Плани активностей відновлено',
                    'body'  => 'Плани активностей було успішно відновлено.',
                ],
            ],

            'delete' => [
                'notification' => [
                    'title' => 'Плани активностей видалено',
                    'body'  => 'Плани активностей було успішно видалено.',
                ],
            ],

            'force-delete' => [
                'notification' => [
                    'title' => 'Плани активностей остаточно видалено',
                    'body'  => 'Плани активностей було остаточно видалено успішно.',
                ],
            ],
        ],

        'empty-state' => [
            'create' => [
                'notification' => [
                    'title' => 'План активності створено',
                    'body'  => 'План активності було успішно створено.',
                ],
            ],
        ],
    ],

    'infolist' => [
        'name'   => 'Назва',
        'status' => 'Статус',
    ],
];
