<?php

return [
    'navigation' => [
        'title' => 'Стадії проєкту',
    ],

    'form' => [
        'name' => 'Назва',
    ],

    'table' => [
        'columns' => [
            'name'       => 'Назва',
            'created-at' => 'Створено',
            'updated-at' => 'Оновлено',
        ],

        'groups' => [
            'name'         => 'Назва',
            'is-completed' => 'Виконано',
            'project'      => 'Проєкт',
            'created-at'   => 'Створено',
        ],

        'filters' => [
            'is-completed' => 'Виконано',
            'project'      => 'Проєкт',
            'creator'      => 'Створювач',
        ],

        'actions' => [
            'edit' => [
                'notification' => [
                    'title' => 'Стадію проєкту оновлено',
                    'body'  => 'Стадію проєкту було успішно оновлено.',
                ],
            ],

            'restore' => [
                'notification' => [
                    'title' => 'Стадію проєкту відновлено',
                    'body'  => 'Стадію проєкту було успішно відновлено.',
                ],
            ],

            'delete' => [
                'notification' => [
                    'title' => 'Стадію проєкту видалено',
                    'body'  => 'Стадію проєкту було успішно видалено.',
                ],
            ],

            'force-delete' => [
                'notification' => [
                    'success' => [
                        'title' => 'Стадію проєкту остаточно видалено',
                        'body'  => 'Стадію проєкту було остаточно видалено успішно.',
                    ],
                    'error' => [
                        'title' => 'Стадію проєкту не може бути видалено',
                        'body'  => 'Стадію проєкту не може бути видалено, оскільки вона використовується.',
                    ],
                ],
            ],
        ],

        'bulk-actions' => [
            'restore' => [
                'notification' => [
                    'title' => 'Стадії проєкту відновлено',
                    'body'  => 'Стадії проєкту було успішно відновлено.',
                ],
            ],

            'delete' => [
                'notification' => [
                    'title' => 'Стадії проєкту видалено',
                    'body'  => 'Стадії проєкту було успішно видалено.',
                ],
            ],

            'force-delete' => [
                'notification' => [
                    'title' => 'Стадії проєкту остаточно видалено',
                    'body'  => 'Стадії проєкту було остаточно видалено успішно.',
                ],
            ],
        ],
    ],
];
