<?php

return [
    'navigation' => [
        'title' => 'Стадії завдань',
    ],

    'form' => [
        'name'    => 'Назва',
        'project' => 'Проєкт',
    ],

    'table' => [
        'columns' => [
            'name'       => 'Назва',
            'project'    => 'Проєкт',
            'created-at' => 'Створено',
            'updated-at' => 'Оновлено',
        ],

        'groups' => [
            'project'    => 'Проєкт',
            'created-at' => 'Створено',
        ],

        'filters' => [
            'project' => 'Проєкт',
        ],

        'actions' => [
            'edit' => [
                'notification' => [
                    'title' => 'Стадію завдання оновлено',
                    'body'  => 'Стадію завдання було успішно оновлено.',
                ],
            ],

            'restore' => [
                'notification' => [
                    'title' => 'Стадію завдання відновлено',
                    'body'  => 'Стадію завдання було успішно відновлено.',
                ],
            ],

            'delete' => [
                'notification' => [
                    'title' => 'Стадію завдання видалено',
                    'body'  => 'Стадію завдання було успішно видалено.',
                ],
            ],

            'force-delete' => [
                'notification' => [
                    'success' => [
                        'title' => 'Стадію завдання остаточно видалено',
                        'body'  => 'Стадію завдання було остаточно видалено успішно.',
                    ],
                    'error' => [
                        'title' => 'Стадію завдання не може бути видалено',
                        'body'  => 'Стадію завдання не може бути видалено, оскільки вона використовується.',
                    ],
                ],
            ],
        ],

        'bulk-actions' => [
            'restore' => [
                'notification' => [
                    'title' => 'Стадії завдань відновлено',
                    'body'  => 'Стадії завдань було успішно відновлено.',
                ],
            ],

            'delete' => [
                'notification' => [
                    'title' => 'Стадії завдань видалено',
                    'body'  => 'Стадії завдань було успішно видалено.',
                ],
            ],

            'force-delete' => [
                'notification' => [
                    'title' => 'Стадії завдань остаточно видалено',
                    'body'  => 'Стадії завдань було остаточно видалено успішно.',
                ],
            ],
        ],
    ],
];
