<?php

return [
    'table' => [
        'header-actions' => [
            'create' => [
                'label' => 'Створити підзавдання',

                'notification' => [
                    'title' => 'Підзавдання створено',
                    'body'  => 'Підзавдання було успішно створено.',
                ],
            ],
        ],

        'actions' => [
            'restore' => [
                'notification' => [
                    'title' => 'Підзавдання відновлено',
                    'body'  => 'Підзавдання було успішно відновлено.',
                ],
            ],

            'delete' => [
                'notification' => [
                    'title' => 'Підзавдання видалено',
                    'body'  => 'Підзавдання було успішно видалено.',
                ],
            ],

            'force-delete' => [
                'notification' => [
                    'title' => 'Підзавдання остаточно видалено',
                    'body'  => 'Підзавдання було остаточно видалено успішно.',
                ],
            ],
        ],
    ],
];
