<?php

return [
    'title' => 'Підзадачі',

    'table' => [
        'header-actions' => [
            'create' => [
                'label' => 'Додати підзадачу',

                'notification' => [
                    'title' => 'Підзадачу створено',
                    'body'  => 'Підзадачу було успішно створено.',
                ],
            ],
        ],

        'actions' => [
            'restore' => [
                'notification' => [
                    'title' => 'Підзадачу відновлено',
                    'body'  => 'Підзадачу було успішно відновлено.',
                ],
            ],

            'delete' => [
                'notification' => [
                    'title' => 'Підзадачу видалено',
                    'body'  => 'Підзадачу було успішно видалено.',
                ],
            ],

            'force-delete' => [
                'notification' => [
                    'title' => 'Підзадачу остаточно видалено',
                    'body'  => 'Підзадачу було остаточно видалено успішно.',
                ],
            ],
        ],
    ],
];
